[
    {
      "name": "sad traveler",
      "quote": {
        "initial" : "\nHey kid, you look like an enthusiastic adventurer.\n I am a weary traveler who has been searching for a secret treasure for years, with no luck in my pursuit.\n Here, take this darned paper and see if your luck is any better than mine.\n",
        "quit" : "Safe travels, kid..."
        },
      "items": [
        "map"
        ],
      "hp": 10,
      "isFriendly": true
    },
    {
      "name": "pirate captain",
      "quote": {
        "initial": "\nAhoy adventurer, I am Captain Ron.\n",
        "quest" : "\nIf it’s a ship you seek, I will not help you.\n You see it’s my lucky PARROT, Polly. A fallen mango spooked the ole girl, and she flew into the mango forest.\n I will not set sail without her, for it would surely lead me to a doomed fate at sea.\n Hey, if you are able to find her and bring my Polly back, I would take you anywhere you want.\n Would you find her for me? [yes/no]\n",
        "yes": "\nThank you adventurer, these are her favorite CRACKERS, if she sees it she will surely come to you.\n",
        "no": "\nArrggh, then away with you!",
        "parrot": "",
        "reward":"\nOh jolly, you found Polly. Thank you so much! Hey it’s a dangerous world out there.\n Go see the blacksmith for a SWORD, and then we will set sail when you're ready.\n Board the ship, and type GO followed by the name of your desired island, and we can get sailing.\n",
        "quit": "\nArrggh\n"
      },
      "items": [
        "cracker"
      ],
      "reward" : [
        "Boat Pass"
      ],
      "questReq" : ["parrot"],
      "hp": 10,
      "isFriendly": true
    },
    {
      "name": "uncle",
      "quote": {
        "initial": "\nHey Nephew, it’s great to see you. I’ve heard you are on a big adventure.\n It’s a dangerous world out there, so I fashioned you this SWORD to take.\n Also, take this MANGO, if you fall ill it will replenish 5pts. of your health. Be safe out there.\n",
        "quit" : "Come back to visit anytime Nephew."
      },
      "items": [
        "sword", "mango"
        ],
      "hp": 10,
      "isFriendly": true
    },
    {
      "name": "monkey king",
      "quote": {
      "initial": "\nI am the Monkey King.",
      "quest" : "\nI have no time to speak with outsiders. There are vile monsters invading our Bananas stash in the west, and my son the Monkey Prince has not returned from playing in the Eastern jungle.",
      "reward" : "\nImpressive outsider, you have restored peace to our bananas stash, and saved the Prince from his folly. As a reward I give you this key.\n It is said to be the key to opening the secret treasure of Skull Island.\n Skull Island is a dangerous place, take one of our sacred bananas. If you fall ill, it will replenish 10pts. of your health.\n",
      "quit" : "Hmmmm farewell..."
    },
      "items": [
        "treasure key"
      ],
      "reward" : ["note", "beast skull"],
      "hp": 10,
      "isFriendly": true
    },
    {
      "name": "monkey prince",
      "quote": {
      "initial": "\nHelp, help, I am stuck!",
      "reward" : "\nThank you for cutting those vines, I will tell my father, the Monkey King, that you saved me. Also, if you have trouble with the guards, this NOTE will help solve their riddles."
    },
      "items": [
        "note"
      ],
      "reward" : ["vine"],
      "hp": 10,
      "isFriendly": true
    },
    {
      "name": "monkey guards",
      "quote": {
        "initial": "\nWe are the guards to the Monkey Temple. If you want to enter, you must answer our riddles correctly."
      },
      "items": [
        "temple pass"
      ],
      "hp": 10,
      "isFriendly": true
    },
    {
      "type": "NPC",
      "name": "vine",
      "quote": [
        ""
      ],
      "items": [
        "vine"
      ],
      "hp": 1,
      "isFriendly": false
    },
    {
      "name": "Skull King",
      "quote": {
        "initial": "\nFOOOL, your journey ends now. You will never unlock the treasure of Skull island. You shall perish."
      },
      "items": [
        "Treasure room key"
      ],
      "hp": 13,
      "isFriendly": false
    },
    {
      "name": "skeleton beast",
      "quote": [
        "\nclink clank, ahhhhhhh!"
      ],
      "items": ["beast skull"],
      "hp": 5,
      "isFriendly": false
    },
  {
    "name": "skeleton soldier",
    "quote": [
      "\nclink clank, ahhhhhhh!"
    ],
    "items": ["left key"],
    "hp": 5,
    "isFriendly": true
  },
  {
    "name": "skeleton captain",
    "quote": [
      "\nclink clank, ahhhhhhh!"
    ],
    "items": ["right key"],
    "hp": 5,
    "isFriendly": true
  }
  ]