[
    {
    "name": "Map",
      "description": "The map displays three islands: Mango Island, Monkey Island to the North, and Skull Island to the East.\n At the bottom of the map, there is a note: To unlock the secret treasure of Skull Island, seek the Monkey King"
    },
    {
      "name": "Sword",
      "description": "Durable blade forged by your uncle, used for offensive attacks. Increases damage points to 5pts."
    },
    {
      "name": "Parrot",
      "description": "The Pirate Captain’s lucky Parrot"
    },
  {
    "name" : "Monkey Pin",
    "description" : "Awarded from saving the monkey prince, to win respect of monkey king."
  },
    {
      "name": "Mango",
      "description": "Delicious fruit found on Mango Island. Restores health by 5pts",
      "value": 5
    },
    {
      "name": "Cracker",
      "description": "Cracker given by the Pirate Captain, to entice the Parrot"
    },
    {
      "name": "Note",
      "description": "Banana, Monkey Business, Monkey see monkey do"
    },
    {
      "name": "Banana",
      "description": "Delicious fruit found on Monkey Island. Restores health by 10 pts",
      "value": 10
    },
    {
      "name": "Left Boss Key",
      "description": "Left key to unlock the Boss Door"
    },
    {
      "name": "Right Boss Key",
      "description": "Right key to unlock the Boss Door"
    },
    {
      "name": "Treasure Key",
      "description": "Key awarded by earning favor of the Monkey King. Fabled to be the lost key to the secret treasures of Skull Island"
    },
    {
      "name": "Treasure Chest",
      "description": "Congratulations Adventurer, you conquered a great quest"
    },
  {
    "name" : "Treasure room key",
    "description" : "Key earned by defeating Skull King, to access the treasure room"
  },
  {
    "name" : "Boat Pass",
    "description" : "Boarding pass from the Pirate Captain, allows you access to the boat."
  },
  {"name" :  "Temple Pass",
  "description" :  "Ribbon for solving the Monkey Temple guards riddles, allows you access to the temple."}
  ]